{"backend": "tensorflow", "keras_version": "2.0.8", "config": {"layers": [{"config": {"sparse": false, "batch_input_shape": [null, 66, 200, 3], "name": "input_1", "dtype": "float32"}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"trainable": true, "output_shape": null, "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001zr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u001c\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape_type": "raw", "function_type": "lambda"}, "name": "lambda_1", "class_name": "Lambda", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "bias_regularizer": null, "padding": "valid", "activation": "linear", "bias_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "trainable": true, "filters": 24, "activity_regularizer": null, "strides": [2, 2], "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "name": "elu_1", "class_name": "ELU", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["elu_1", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "bias_regularizer": null, "padding": "valid", "activation": "linear", "bias_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "trainable": true, "filters": 36, "activity_regularizer": null, "strides": [2, 2], "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "name": "elu_2", "class_name": "ELU", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}, "name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["elu_2", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "bias_regularizer": null, "padding": "valid", "activation": "linear", "bias_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "trainable": true, "filters": 48, "activity_regularizer": null, "strides": [2, 2], "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "name": "elu_3", "class_name": "ELU", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_3"}, "name": "dropout_3", "class_name": "Dropout", "inbound_nodes": [[["elu_3", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "bias_regularizer": null, "padding": "valid", "activation": "linear", "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "name": "elu_4", "class_name": "ELU", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_4"}, "name": "dropout_4", "class_name": "Dropout", "inbound_nodes": [[["elu_4", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_5", "bias_regularizer": null, "padding": "valid", "activation": "linear", "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "name": "elu_5", "class_name": "ELU", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_5"}, "name": "dropout_5", "class_name": "Dropout", "inbound_nodes": [[["elu_5", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"config": {"units": 100, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "elu_6", "alpha": 1.0}, "name": "elu_6", "class_name": "ELU", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_6"}, "name": "dropout_6", "class_name": "Dropout", "inbound_nodes": [[["elu_6", 0, 0, {}]]]}, {"config": {"units": 50, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_2", "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "elu_7", "alpha": 1.0}, "name": "elu_7", "class_name": "ELU", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_7"}, "name": "dropout_7", "class_name": "Dropout", "inbound_nodes": [[["elu_7", 0, 0, {}]]]}, {"config": {"units": 10, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_3", "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "elu_8", "alpha": 1.0}, "name": "elu_8", "class_name": "ELU", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"config": {"units": 1, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_4", "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "name": "dense_4", "class_name": "Dense", "inbound_nodes": [[["elu_8", 0, 0, {}]]]}], "output_layers": [["dense_4", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}